Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/travel_and_recreation/motoring_1/driving_offences/cycling_offences.html.txt.tmx
Source language: en
Languages: ga

source: If you are cycling it is important that you are aware of the laws in place regarding cycling and the penalties in place if you break the law
ga: Má bhíonn tú ag rothaíocht, is tábhachtach go mbíonn cur amach agat ar na dlíthe atá i bhfeidhm maidir le rothaíocht agus na pionóis atá i bhfeidhm má sháraíonn tú an dlí

source: The Road Traffic Acts 1961-2014 set out the main provisions for motoring and legislate for bicycles as well as mechanically propelled vehicles and trailers
ga: Leagtar amach sna hAchtanna um Thrácht ar Bhóithre, 1961-2014 na príomhfhorálacha le haghaidh gluaisteánaíochta agus déantar reachtú le haghaidh rothar anuas ar fheithiclí agus leantóirí atá faoi thiomáint mheicniúil

source: There is also secondary legislation which regulates the behaviour of motorists and cyclists
ga: Anuas air sin, tá reachtaíocht thánaisteach ann a rialaíonn iompar tiománaithe agus rothaithe

source: As well as those regulating cyclist behaviour, there are regulations setting out the equipment a bicycle must have
ga: Anuas orthu siúd a rialaíonn iompar rothaithe, tá rialacháin ann ina leagtar amach an trealamh nach mór bheith ar rothar

source: Under the Road Traffic (Lighting of Vehicles) Regulations 1963 a bicycle ridden in a public place during lighting-up hours must be equipped with a rear red reflector, and with front and rear lights that can be seen from a reasonable distance
ga: Faoi na Rialacháin um Thrácht ar Bhóithre (Soilsiú Feithiclí), 1963, ní mór go mbíonn frithchaiteoir dearg cúil agus soilse tosaigh agus cúil ar féidir iad a fheiceáil ó fhad réasúnta a bheith ar rothar a rothaítear in áit phoiblí i rith na n-uaireanta soilsithe

source: The front light must be white or yellow, while the rear light must be red
ga: Ní mór go bhfuil an solas tosaigh bán nó buí, agus ní mór don solas cúil a bheith dearg

source: It is legal to use flashing lights
ga: Tá sé in aghaidh an dlí soilsithe gealánacha a úsáid

source: You can find more information in our document on lighting of bicycles
ga: Is féidir leat teacht ar thuilleadh faisnéise inár gcáipéis ar shoilsiú rothar

source: Under the Road Traffic (Construction, Equipment and Use of Vehicles) Regulations 1963 a bicycle used in a public place must be fitted with a bell capable of being heard at a reasonable distance
ga: Faoi na Rialacháin um Thrácht ar Bhóithre (Tógáil, Trealamh agus Úsáid Feithiclí), 1963, ní mór clog, ar féidir é a chloisteáil ag fad réasúnta, a bheith feistithe ar rothar a úsáidtear in áit phoiblí

source: It must also be equipped with brakes, one for the front wheel and another for the rear wheel
ga: Anuas air sin, ní mór coscáin a bheith ar an rothar – coscán amháin don roth tosaigh agus coscán eile don roth cúil

source: Your bicycle and its equipment must be in good working order
ga: Ní mór go mbíonn dea-ord oibre ar do rothar agus trealamh an rothair

source: Under Section 20 of the Road Traffic Act 1961, if a Garda, having tested your bicycle, has reasonable grounds for believing that your bicycle has a dangerous defect, the Garda may instruct you not to ride the bicycle in a public place until the defect is remedied
ga: Faoi Alt 20 den Acht um Thrácht ar Bhóithre, 1961, má tá bunúis réasúnta ag Garda, tar éis tástáil a dhéanamh ar do rothar, lena chreidiúint go bhfuil locht contúirteach ar do rothar, féadfaidh an Garda thú a ordú gan an rothar a rothaíocht in áit phoiblí go dtí go gceartaítear an locht

source: If you fail to do as requested, you are committing an offence
ga: Má theipeann ort é sin a dhéanamh a iarradh ort, tá cion á dhéanamh agat

source: When cycling you must obey the rules set out in the Road Traffic Acts and Road Traffic (Traffic and Parking) Regulations 1997-2014
ga: Nuair a bhíonn tú ag rothaíocht, ní mór duit cloí leis na rialacha a leagtar amach sna hAchtanna um Thrácht ar Bhóithre (Trácht agus Páirceáil), 1997-2014

source: For example, Article 11 of the Road Traffic (Traffic and Parking) (Amendment) (No
ga: Mar shampla, cuireann Airteagal 11 sna Rialacháin um Thrácht ar Bhóithre (Trácht agus Páirceáil) (Leasú) (Uimh

source: 2) Regulations 2012 prohibits you from cycling beyond a traffic sign that prohibits bicycles
ga: 2), 2012 toirmeasc ort ó rothaíocht níos faide ná comhartha tráchta a chuireann toirmeasc ar rothair

source: Article 14 of the Road Traffic (Traffic & Parking) Regulations 1997 (as substituted by the 2012 Regulations) provides that where a cycle lane is provided, you must use it
ga: Foráiltear in Airteagal 14 de na Rialacháin um Thrácht ar Bhóithre (Trácht agus Páirceáil), 1997 (arna ionadú ag Rialacháin 2012), nuair a sholáthraítear lána rothar, ní mór duit é a úsáid

source: If the cycle lane is a contra-flow cycle lane, you can only cycle in the contra-flow direction on it
ga: Más lána rothar in aghaidh an tsrutha an lána rothar, ní féidir leat rothaíocht sa lána ach sa treo in aghaidh an tsrutha

source: Article 13 of the 1997 Regulations makes it an offence to cycle on a footpath unless you are entering or exiting a property
ga: De réir Airteagal 13 de Rialacháin 1997, is cion é rothaíocht ar chosán mura bhfuil tú ag iontráil nó ag fágáil maoine

source: Under Article 45 of the 1997 Regulations (as amended by the Road Traffic (Traffic and Parking) (Amendment) Regulations 1998), you must not cycle in a pedestrianised street or area during the period indicated on the information plate accompanying the pedestrianised street or area traffic sign, unless you are cycling on a cycle lane
ga: Faoi Airteagal 45 de Rialacháin 1997, (arna leasú ag na Rialacháin um Thrácht ar Bhóithre (Trácht agus Páirceáil), 1998), ní mór duit gan rothaíocht i sráid a ndearnadh sráid do choisithe amháin di i rith na tréimhse a thugtar le fios ar an bpláta faisnéise a bhaineann leis an tsráid do choisithe amháin nó ar an gcomhartha tráchta ceantair, mura bhfuil tú ag rothaíocht ar lána rothar

source: Like other road users, cyclists must obey the rules applying to traffic lights, pedestrian crossings, zebra crossings and cycle traffic lights
ga: Ar nós úsáideoirí bóthair eile, ní mór do rothaithe cloí leis na rialacha a bhaineann le soilse tráchta, trasbhealaí coisithe, trasrianta síogacha agus soilse tráchta rothar

source: You must stop at stop signs and yield right of way at yield signs
ga: Ní mór duit stopadh ag comharthaí stop agus ceart slí a ghéilleadh ag comharthaí géill slí

source: Under Article 47 of the 1997 Regulations (as substituted by the 2012 Regulations), you must not cycle more than 2 abreast, except when overtaking and it does not endanger or obstruct other traffic
ga: Faoi Airteagal 47 de Rialacháin 1997 (arna ionadú ag Rialacháin 2012), ní mór nach rothaíonn níos mó ná beirt taobh le taobh, seachas nuair atá tú ag gabháil thar rothaí eile agus a fhad agus nach gcuireann sé trácht eile i mbaol nó nach gcuireann sé bac ar thrácht eile

source: You can overtake a vehicle on the left where the vehicles to your right are stationary or are moving slower than you, except when the vehicle to be overtaken:
ga: Féadfaidh tú gabháil thar fheithicil ar thaobh na láimhe clé sa chás go bhfuil feithiclí ar thaobh na láimhe deise stoptha nó ag gluaiseacht níos moille ná tú féin, seachas sna cásanna a leanas:

source: • Has signalled an intention to turn to the left and will execute the movement to the left before you overtake it
ga: • Chomharthaigh an fheithicil, a bhfuil tú ag iarraidh gabháil thairsti, go bhfuil sé i gceist acu casadh ar thaobh na láimhe clé agus go dtabharfaidh an fheithicil sin faoin ngluaiseacht sin ar thaobh na láimhe clé sula ngabhann tú thairsti

source: • Is stationary for the purpose of allowing a passenger to alight or board the vehicle
ga: • Tá an fheithicil a bhfuil tú ag iarraidh gabháil thairsti stoptha ar mhaithe le ligean do phaisinéir an fheithicil a fhágáil nó an fheithicil a iontráil

source: • Is stationary for the purposes of loading or unloading
ga: • Tá an fheithicil a bhfuil tú ag iarraidh gabháil thairsti stoptha ar mhaithe le lódáil nó dílódáil

source: Section 100 of the Road Traffic Act 1961 makes it an offence to ride a bicycle while holding on to another moving vehicle (other than another bicycle which no one is riding)
ga: Foráiltear in Alt 100 den Acht um Thrácht ar Bhóithre, 1961 gur cion é rothar a rothaíocht fad atá greim láimhe beirthe agat ar fheithicil eile atá ag gluaiseacht (seachas rothar eile nach bhfuil á rothaíocht ag duine ar bith)

source: A Garda can ask for your name, address and date of birth if you are suspected of:
ga: Féadfaidh Garda iarraidh ort d’ainm, seoladh agus dáta breithe a sholáthar má tá siad in amhras ar an méid a leanas:

source: • Having been involved in a collision or other event in a public place causing injury or damage
ga: • Bhí baint agat in imbhualadh nó i dteagmhas eile in áit phoiblí a bhí ina chúis le gortú nó díobháil

source: If you refuse to give your details or give details which the Garda believes to be false or misleading, the Garda can take your bicycle and retain it until such time as your identity is proven
ga: Má dhiúltaíonn tú chun do chuid sonraí a thabhairt nó má thugann tú sonraí a chreideann an Garda atá bréagach nó míthreorach, féadfaidh an Garda do rothar a thógáil agus é a choinneáil go dtí an tráth sin a chruthaítear d’aitheantas

source: A Garda can arrest you without a warrant:
ga: Féadfaidh Garda thú a ghabháil gan bharántas sna cásanna a leanas:

source: • If you are riding a bicycle while under the influence of alcohol and/or drugs so that you do not have proper control of the bicycle
ga: • Má tá rothar á rothaíocht agat fad atá tú ar meisce agus/nó faoi thionchar drugaí agus nach bhfuil smacht ceart agat ar an rothar dá bharr

source: • If the Garda has reasonable grounds for believing that you are riding a bicycle without the owner’s consent
ga: • Má tá bunúis réasúnta ag an nGarda lena chreidiúint go bhfuil rothar á rothaíocht agat gan toiliú an úinéara

source: If you are charged with a cycling offence, you will have to attend court
ga: Má chúisítear thú le cion rothaíochta, beidh ort freastal ar an gcúirt

source: In general, if you are guilty of a cycling offence, you are liable on summary conviction:
ga: Go ginearálta, má tá tú ciontach i gcion rothaíochta, beidh tú faoi dhliteanas ar chiontú achomair:

source: • In the case of a first offence to a class D fine
ga: • I gcás an chéad chiona, fíneáil aicme D a íoc

source: • In the case of a second or subsequent such offence to a class C fine
ga: • I gcás an dara cion nó cionta ina dhiaidh sin, fíneáil aicme C a íoc

source: In the case of 3 or more such offences in a 12-month period you are liable to a class C fine or to imprisonment for up to 3 months, or to both a fine and imprisonment
ga: I gcás 3 chion nó níos mó den saghas sin i dtréimhse 12 mhí, beidh tú faoi dhliteanas fíneáil aicme C a íoc nó tréimhse nach faide ná 3 mhí a chaitheamh sa phríosún, nó fíneáil a íoc agus tréimhse a chaitheamh sa phríosún

source: If you are convicted of riding a bicycle while under the influence of alcohol and/or drugs, you are liable on summary conviction to a class C fine
ga: Má chiontaítear thú i leith rothar a rothaíocht fad atá tú ar meisce agus/nó faoi thionchar drugaí, beidh tú faoi dhliteanas ar chiontú achomair fíneáil aicme C a íoc

source: Under the Road Traffic (Fixed Charges Offences – Cyclists) Regulations 2015 (pdf) certain cycling offences have been declared to be fixed charge offences
ga: Faoi na Rialacháin um Thrácht ar Bhóithre (Cionta Muirir Sheasta – Rothaithe), 2015 (pdf), fógraíodh gurb ionann cionta áirithe rothaíochta agus cionta muirir sheasta

source: The fixed charge system allows someone who has been detected committing a fixed charge offence to pay a fixed charge or fine as an alternative to going to court to answer the offence
ga: Ceadaíonn an córas muirir sheasta do dhuine ar braitheadh é/í agus cion muirir sheasta á dhéanamh aige/aici chun muirear seasta a íoc mar rogha ar dhul chuig an gcúirt chun freagairt don chion

source: The fixed charge for a cycling offence is set at €40
ga: Is ionann an muirear seasta do chion rothaíochta agus €40

source: Since 31 July 2015 the cycling offences to which a fixed charge applies are:
ga: Ón 31 Iúil 2015, is iad na cionta rothaíochta lena mbaineann muirear seasta:

source: • No front or rear light during lighting-up hours
ga: • Solas tosaigh nó cúil ar bith a bheith ar rothar i rith uaireanta soilsithe

source: • Riding a bicycle without reasonable consideration
ga: • Rothar a rothaíocht gan breithniú réasúnta

source: • Failing to stop for a school warden sign
ga: • Teip ar stopadh le haghaidh comhartha maor scoile

source: • Failing to stop at traffic lights when the red lamp is lit
ga: • Teip ar stopadh ag soilse tráchta nuair atá an solas dearg ar lasadh

source: • Failing to stop at cycle traffic lights when the red lamp is lit
ga: • Teip ar stopadh ag soilse tráchta rothar nuair atá an solas dearg ar lasadh

source: • Failing to stop at a stop line, barrier or half barrier at a railway level crossing, swing bridge or lifting bridge, when the red lamps are flashing
ga: • Teip ar stopadh ag líne stop, bacainn nó leathbhacainn ag trasrian líne iarnróid, droichead lúdrach nó droichead ardaithe, nuair atá na soilse dearga ar lasadh

source: • Cycling in a pedestrianised street or area
ga: • Rothaíocht ar shráid nó i limistéar do choisithe amháin

source: If you receive a fixed charge notice, you have 28 days from the date of the issue of the fixed charge notice to pay the fine
ga: Má fhaigheann tú fógra muirir sheasta, tá 28 lá agat ó dháta eisiúna an fhógra muirir sheasta chun an fhíneáil a íoc

source: If it is not paid within 28 days, the charge is increased by 50%
ga: Mura n-íoctar é laistigh de 28 lá, méadaítear an muirear 50%

source: If it is still unpaid after a further 28 days then court proceedings are initiated
ga: Murar íocadh as go fóill i ndiaidh 28 lá breise, cuirtear tús le himeachtaí cúirte

source: If you misplace, lose or damage your fixed charge notice, you should contact the Garda Fixed Charge Processing Office (see ‘Where to apply’ below)
ga: Má chailleann tú, má dhéanann tú díobháil do d’fhógra muirir seasta nó má tá sé ar iarraidh, ba cheart duit teagmháil a dhéanamh le hOifig Phróiseála Muirear Seasta an Gharda Síochána (féach ‘Cá ndéanfaidh mé iarratas? ’ thíos)

source: A re-print of the notice will be sent to you by post
ga: Seolfar athphrionta den fhógra chugat sa phost

source: However, the time period allowed for payment is not extended by your request for a re-print
ga: Ní shíntear an tréimhse ama a cheadaítear le haghaidh íocaíochta mar gheall gur iarr tú ar athphrionta, áfach

source: If the fixed charge notice is paid within the legal time limits and court proceedings are not commenced, you will not have a criminal record in respect of the offence
ga: Mura n-íoctar an fógra muirir sheasta laistigh de na teorainneacha dlíthiúla ama agus mura gcuirtear tús le himeachtaí cúirte, beidh taifead coiriúil agat maidir leis an gcion

source: Further information on fixed charge notices is available on the Garda website
ga: Tá fáil ar bhreis faisnéise ar fhógraí muirir sheasta ar láithreán gréasáin an Gharda Síochána

source: It also has a guide to cancellations of fixed charge notices
ga: Anuas air sin, tá treoir ann maidir le cealuithe fógraí muirir sheasta ar an láithreán gréasáin

source: Garda Fixed Charge Processing Office
ga: Oifig Próiseála Muirear Seasta an Gharda Síochána
